Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/science/uit/master/paulette_van_der_voet_nob.pdf.tmx
Source language: nob
Languages: sme

source: Abstrakt
sme: Abstrákta

source: Hensikten med denne oppgaven var å undersøke hvilken språkutdanningspolitikk samiske barn i Norge møter gjennom sitt utdanningsløp, fra barnehage til videregående skole.
sme: Dán masterčállosa ulbmil lea iskat iešguđetge giellaoahpahuspolitihkaid mat váikkuhit sámi mánáid oahppomannolahkii Norggas, mánáidgárddis gitta joatkkaskuvlii.

source: Utdanningssystemet spiller en avgjørende rolle i samisk språkrevitalisering, og dette revitaliseringsarbeidet reflekteres i dagens læreplaner.
sme: Oahpahusvuogádagas lea mearrideaddji rolla sámegiela ealáskahttimis, ja dát ealáskahttindoaibma vuhtto dálá oahppoplánain.

source: Kritisk diskursanalyse ble benyttet for å analysere de politiske dokumentene som er relevant for samisk språkopplæring.
sme: Geavahettiin kritihkalaš diskursaanalysa analyserejuvvojit politihkalaš dokumeanttat mat leat relevánttat sámegiela oahpahussii.

source: Mer spesifikt består datamaterialet av de delene som er relevante for samisk i den nåværende Rammeplanen for barnehagen, Læreplanverket for kunnskapsløftet og Læreplanverket for kunnskapsløftet – samisk.
sme: Eanet spesifihkka gullet dáhtaide dálá Mánáidgárddi rámmaplána, Máhttoloktema oahppoplánabuktosa ja Máhttolokten – Sámi oahppoplánabuktosa oasit mat leat relevánttat sámegiela oahpahussii.

source: Det første spørsmålet er hvordan mulighetene for å lære og bruke samisk i barnehage og skole er regulert.
sme: Vuosttaš gažaldat lea mo vejolašvuođat oahppat ja geavahit sámegiela mánáidgárddis ja skuvllas leat regulerejuvvon.

source: Det andre spørsmålet er hvilke språkideologier om de samiske språkene reflekteres i disse dokumentene.
sme: Nubbi gažaldat lea makkár giellaideologat sámegielaid hárrái bohtet oidnosii dáin dokumeanttain.

source: Tre faktorer spiller en viktig rolle i reguleringen av mulighetene for å lære og bruke samisk i barnehage og skole.
sme: Golmma fáktoris lea dehálaš rolla reguleret vejolašvuođaid oahppat ja geavahit sámegiela mánáidgárddis ja skuvllas.

source: Den første faktoren er den geografiske dimensjonen av forvaltningsområdet for samisk språk, som på den ene siden bidrar til å styrke samisk språk innenfor forvaltningsområdet, men derimot gir mindre muligheter til å lære og bruke samisk i barnehage og skole til barn som bor utenfor forvaltningsområdet.
sme: Vuosttaš fáktor lea sámegielaid hálddašanguovllu geográfalaš dimenšuvdna, mii nuppe dáfus lea mielde nanneme sámegielaid dan guovllu siskkobealde, muhto mii fas nuppe dáfus addá mánáide geat orrot dán guovllu olggobealde unnit vejolašvuođaid oahppat ja geavahit sámegiela mánáidgárddis ja skuvllas.

source: Den andre faktoren er de forskjellige diskurser om viktigheten med samisk språkutdanning i rammeplanen og læreplanene.
sme: Nuppi fáktorii gullet dat iešguđetge diskurssat mat gusket sámegiela oahpahusa dehálašvuhtii rámmaplánas ja oahppoplánain.

source: Der rammeplanen nærmer seg samisk språkopplæring fra barnets interesse, fokuserer læreplanene mer på viktigheten av å revitalisere språkene.
sme: Rámmaplána lahkona sámegiela oahpahusa máná beroštumiid vuođul, ja oahppoplána fas guovdilastá dehálašvuođa ealáskahttit sámegielaid.

source: Den tredje faktoren er funksjonell tospråklighet som representerer både et middel og et mål for samisk språkopplæring i læreplanene.
sme: Goalmmát fáktor lea doaibmi guovttegielalašvuohta, mii oahppoplánain lea sihke sámegiela oahpahusa gaskaoapmi ja ulbmil.

source: Funksjonell tospråklighet er ikke nærmere definert i læreplanene, noe som gjør at lærerne kan tilpasse sin undervisning til det enkelte barn.
sme: Doaibmi guovttegielalašvuohta ii leat meroštallon lagabut oahppolánain, ja dat addá oahpaheddjiide vejolašvuođa heivehit oahpahusa ovttaskas oahppái.

source: For å oppsummere, barn som potensielt følger samisk språkutdanning i Norge er en mangfoldig gruppe på mange forskjellige måter, og det er viktig at læreplanene gir plass til å tilpasse språkopplæring til dette mangfoldet.
sme: Čoahkkáigeasedettiin leat mánát geain lea vejolašvuohta čuovvut sámegiela oahpahusa Norggas, máŋggabealat joavku máŋgga iešguđet ládje, ja lea dehálaš ahte oahppoplánat čáhkkejit saji heivehit giellaoahpahusa dán máŋggabealatvuhtii.

source: Nøkkelord: samisk, urfolkspråk, språkpolitikk og planlegging, språkrevitalisering, cultural interface, læreplananalyse, kritisk diskursanalyse
sme: Fáddásánit: sámegiella, eamiálbmotgiella, giellapolitihkka ja -plánen, giellaealáskahttin, cultural interface, oahppoplánaanalysa, kritihkalaš diskursaanalysa
